{
  "reqs_design_1": "Provide a list of functional requirements for the model. Such as: Code language/environment (R, Python, SAS); Anticipated data types for input/output.",
  "reqs_design_2": "If applicable, define the level of acceptable uncertainty for the model results (related to models, parameters, constraints, and data).",
  "reqs_design_3": "Describe the procedure or process for identifying all assumptions and anticipated limitations of the code-based model.",
  "reqs_design_1_1": "Describe the process of maintaining and documenting all versions of code during EIO.",
  "reqs_design_1_2": "Describe how dependencies (packages or external software) will be documented and managed (e.g., ‘citation ()’ function can be used within the code for R or the SETUPTOOLS package development process library in Python).",
  "reqs_design_1_3": "Identify and describe any community or internal standards that will be followed when writing code (e.g., code style, easy-to-understand object names, subheadings, etc.).",
  "reqs_design_2_1": "Identify who is responsible for the evaluating or reviewing the code.",
  "reqs_design_2_2": "Identify and describe any tools that may be used to assist with evaluating or reviewing the code (e.g., static code evaluation, linters, IDE style/spelling checks, etc.).",
  "reqs_design_2_3": "Describe the process by which these code evaluations or reviews will be documented (e.g., research notebooks, worksheets, in the code, in code commits, as GitHub issues, Jira, etc.).",
  "reqs_design_2_4": "Describe the acceptance criteria for these evaluations and reviews.",
  "reqs_design_2_5": "Describe the process for resolving issues identified during evaluating and reviewing code and how it will be documented.",
  "reqs_design_3_1": "Describe how the tests will be performed (e.g., is code executable, using the unit testing package in R, using the tox testing tool, or using the pytest testing framework in Python).",
  "reqs_design_3_2": "Describe how the tests will be documented (e.g., results in a research notebook, GitHub actions).",
  "reqs_design_3_3": "Describe the criteria that will be used to evaluate tests to ensure results are sufficient (e.g., test coverage).",
  "reqs_design_3_4": "Describe how will test failures will be documented, and issues resolved.",
  "tool_validation_1": "Describe in detail how the developed model/tool/package will be evaluated and who will perform the evaluation. [e.g., model/tool supported by the quantity and quality of the data, how close the model approximates the real system of interest (model corroboration), model/tool performance, sensitivity and uncertainty analysis, bench marking/parallel testing, meets Data Quality Objectives, Information Quality Guidelines, meets model/tool requirements, secondary code reviews or runs.]",
  "tool_validation_2": "Describe how the developed model/tool will be validated for use and who will perform the validation.",
  "outputs_results_1": "Describe any plans to perform calculations or analysis on the results, including data conversions, who will perform them and how they will be documented.",
  "outputs_results_2": "If applicable, describe the process for identifying sections of code that match any figures/graphs, or results in the final product(s).",
  "outputs_results_3": "Identify if there is a plan to ensure results are reproducible and match any figures and narrative text in the final product(s).",
  "outputs_results_4": "Describe how the code will be shared with the final product.",
  "outputs_results_5": "Describe the process to evaluate the outputs, including any further statistical analysis to be performed to validate the results."
}