{
  "exp_process_1": "Describe the rationale for the approach, sample types, number of samples required, analyte(s) of interest and matrices.",
  "exp_process_2": "Describe maximum holding times for sample extraction and/or analysis; selection and preparation of sample containers; sample volumes; preservation methods. Identify any required method detection limits, reporting limits or critical thresholds (e.g., screening levels, maximum contaminant level (MCL)) for each analyte.",
  "exp_process_3": "Describe any limitations or special challenges that are anticipated and plans to mitigate those limitations/challenges (e.g., matrix interferences, sample homogeneity, representativeness, completeness, site access, etc.).",
  "analytical_method_1": "Identify the specific analyte(s) of interest and the matrix/matrices or limitations to the range of detection under investigation.",
  "analytical_method_2": "Describe any tests of interference and analyte stability. If a holding time study will be conducted, describe the parameters of this study.",
  "analytical_method_3": "Provide the requirements for samples including those field collected or made in the laboratory, that will be used to test the method, including matrix and presence/concentration of analytes.",
  "analytical_method_4": "Describe in detail the method validation process (e.g., intramural laboratory, extramural laboratories, etc.).",
  "animals_1": "Describe and characterize the choice of animal subjects to be tested including ACUP references, if applicable, in addressing the project objectives. This description should include the rationale for the approach, such as the choice of chemicals, materials, or other stressors to be tested in addressing the project objectives.",
  "animals_2": "Describe metrics, physical or behavioral features, or dependent variables to be measured or observed (e.g., survival/lethality, reaction time, cell appearance or morphology of organs, weight, viability, gene expression, behavioral changes, etc.).",
  "animals_3": "Describe the method for determining test group treatment, number, and size (dose limits; power calculations). Describe study controls (blinding, standard curves, positive/negative controls, replicates, sentinel, sham animals, etc.) If applicable, describe the test group assignment method and identification for individual animal subjects (randomization, tagging, group housing).",
  "cell_1": "Describe and characterize the cell culture model to be used in addressing the project objectives. This description should include the rationale for the approach, such as the choice of chemicals, materials, or other stressors to be tested in addressing the project objectives.",
  "cell_2": "Describe metrics or dependent variables to be measured or observed (e.g., survival/lethality, cell appearance, gene expression, etc.).",
  "samples_1": "Identify sampling locations, type of sample collection, frequency and the steps taken to assure that representative samples are collected. If locations are not predetermined, describe the process and criteria for site selection.",
  "samples_2": "Determine if per the National Environmental Policy Act (NEPA) an Environmental Assessment (EA) needs to be prepared and follow agency NEPA procedures if applicable.",
  "samples_3": "Describe procedures for maintaining sample integrity such as labeling (uniquely identify each sample and sub aliquots of samples), custody, sample receipt procedures: packing, and shipping field samples, and provisions for maintaining chain-of-custody (i.e., receipt of, etc.), as applicable.",
  "samples_4": "Describe or reference procedures for the retention (holding times), storage (including sample preservation requirements such as refrigeration, acidification, etc.), disposal of samples collected for this research effort.",
  "samples_5": "For field measurements/analyses (including in-line measurements), reference (e.g., SOP, method) or describe each field sample analysis method and instrumentation to be used.",
  "samples_6": "Describe or reference procedures for field equipment use (e.g., decontamination, maintenance, calibration, storage etc.) and sample collection. Reference SOPs or methods used where applicable.",
  "samples_7": "Describe the use of project specific field records that provide objective evidence of actions taken and observations made. Examples of field records include (but not limited to): field logbook entries, field collection forms, field measurement data log, chain of custody forms, photographs, maps, field inspection forms, etc.",
  "exp_procedure_1": "For laboratory measurements/analyses, describe in detail or give a reference for (e.g., SOP, method including the number, version/revision date and regulatory citation) each sample analysis method and instrumentation to be used.",
  "exp_procedure_2": "Describe how equipment/instruments will be maintained and the availability of critical spare parts, identified in the operating guidance and/or design specifications of the instruments/equipment.",
  "exp_procedure_3": "Identify each laboratory to be used as well as a back-up laboratory if identified as required in systematic planning, contract statements of work, or workplans. Describe the processes for ensuring the laboratory maintains current accreditation and/or certification for applicable analytes and matrices.",
  "exp_procedure_4": "Identify any sample logs, bench sheets, prep logs, analysis logs, etc., used and provide a copy of the document in the appendix of the QAPP, along with the following information: Location of the document in the appendix containing a copy of the sample logs, bench sheets, prep logs, analysis logs, etc.; Format (e.g., paper, or electronic); and How they will be accessible during use.",
  "qc_mm_1": "Identify instruments/equipment, to include, but not limited to tools, gauges, pumps, and analytical instrumentation used for field and laboratory operations.",
  "qc_mm_2": "Include or reference specific laboratory calibration QC procedures, including tune and calibration protocols, instrument performance checks, linearity checks, initial and continuing calibration checks, determination of detection limits (e.g., +/- controls, standard curves, etc.).",
  "qc_mm_3": "Describe the type, frequency, acceptance criteria and corrective actions for each experimental field QC samples such as trip blanks, field blanks, duplicates, matrix spikes and/or control samples.",
  "qc_mm_4": "Describe the type, frequency, acceptance criteria and corrective actions for each experimental laboratory QC samples such as blanks, duplicates, matrix spikes, (+/-) control samples, and surrogates. Describe or reference the procedures to be used to calculate applicable statistics (e.g., precision and bias).",
  "qc_mm_5": "Describe how field and laboratory equipment/instruments will be maintained and the availability of critical spare parts, identified in the operating guidance and/or design specifications of the instruments/equipment.",
  "qc_mm_6": "Describe how lab and field equipment/instrument QC records will be documented and how they will be traceable to the instrument.",
  "qc_mm_7": "Describe any special procedures (or reference a SOP) and the records that need to be maintained to verify the quality, traceability cleanliness, and integrity, etc. of vendors, supplies and consumables in the field and laboratory. Include manufacturer, catalog number, any certifications, and receipt procedures for supplies and consumables.",
  "qc_analyt_1": "Identify the method performance metrics (QA/QC checks) that will be used to evaluate the method. These metrics could include (but are not limited to) positive and negative controls, sensitivity, precision, accuracy, recovery, linearity, specificity, robustness, and range. For each method performance metric (QA/QC check) specify the methods and frequencies for performing these checks, associated acceptance criteria, and corrective actions to be performed if acceptance criteria are not met.",
  "data_review_1": "Describe the process for conducting data reviews. This shall include the data that will be reviewed, the percentage and frequency of data reviewed and personnel responsible for reviewing the data. If multiple people are involved, a table can be created to show who is responsible for each analysis. It is required that the analyst conduct an initial review of the data including QC checks. It is recommended that a secondary reviewer check a subset of the data.",
  "data_review_2": "Describe how the reviews will be recorded and provide the reference to form in the appendix of the QAPP.",
  "data_review_3": "Describe or reference how performance criteria and/or acceptance criteria of information/data quality indicators will be incorporated in the environmental information/data review process.",
  "data_review_4": "Describe procedures for data review discrepancies, how they will be resolved and personnel responsible for resolving the discrepancies.",
  "data_review_5": "State criteria for accepting, rejecting, or qualifying data. Identify how rejected or qualified data will be annotated. If qualifiers are used, provide definitions of the qualifiers.",
  "data_review_6": "Describe any reviews to be conducted of post data analytics outputs (i.e., charts, graphs, statistics) including who is responsible, what will be reviewed, and how these reviews will be documented. State criteria for accepting, rejecting, or qualifying data. Include project-specific calculations or algorithms and provide the reference to form in the appendix of the QAPP.",
  "data_processing_1": "Describe how the data will be summarized or analyzed (e.g., qualitative analysis, descriptive or inferential statistics) to meet the project objective(s) and why the technique(s) were selected.",
  "data_processing_2": "Identify what inputs are needed and what statistical programs will be used. Describe any procedures that will be used to compile or minimize the data prior to data analyses (e.g., exclusion of outliers, handling of qualified data, handling of data reported as qualitative values [i.e., <MRL], range of inclusion).",
  "data_processing_3": "If descriptive statistics are proposed, state what statistics (e.g., mean, median, standard error, minimum and maximum values) will be used to summarize or visualize the data. Identify the criteria used to make decisions (confidence interval, coefficient of determination, test of independence, etc.).",
  "data_processing_4": "If an inferential method is proposed, indicate whether the method will be a hypothesis test, confidence interval, or confidence limit. Describe how the method will be performed and identify any critical thresholds or criteria that will be used to make decisions or draw conclusions.",
  "data_processing_5": "Include project-specific calculations or algorithms used in data processing. (May be discussed in SOP).",
  "data_usability_1": "Describe the reconciliation process which involves the qualitative and quantitative evaluation of the data to determine if the project information is of the right type, quality, and quantity to support its intended use and that the data is suitable for the intended user.",
  "data_usability_2": "Describe how the reconciliation process will be recorded and the personnel responsible.",
  "data_usability_3": "Describe any known or anticipated limitations on the use of the data and how and to whom limitations will be communicated."
}